Show / Hide Table of Contents
Class IDEAProgressReport
Data for progress report of IOM
Inheritance
System.Object
IDEAProgressReport
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Message
Assembly: IdeaRS.OpenModel.dll
Syntax
public class IDEAProgressReport
Properties
Improve this Doc   View Source
CurrentProgressAmount
current progress
Declaration
public int CurrentProgressAmount { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
CurrentProgressMessage
some message to pass to the UI of current progress
Declaration
public string CurrentProgressMessage { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
TotalProgressAmount
total progress
Declaration
public int TotalProgressAmount { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source